config/gptel/tools/question-tools.org
#+title: GPTEL Question Tools
#+property: header-args:emacs-lisp :tangle question-tools.el
#+auto_tangle: y

* File Header

#+begin_src emacs-lisp
;;; question-tools.el --- Async question tool for gptel -*- lexical-binding: t -*-
#+end_src

* Overview

This module implements an async gptel tool that allows LLMs (particularly the planner agent) to collect structured questions from users through an intuitive transient interface.

** Features
- Support for multiple question types (multiple-choice, yes/no, text, numeric)
- Optional comments on answers
- Progress tracking
- Validation of required fields
- Returns structured answers to LLM via callback
- Supports cancellation with partial answers

** Architecture
The tool uses transient for the UI and stores state in ~transient-scope~. When the LLM calls ~ask_questions~, a transient menu is displayed where the user can answer questions in any order. On submit or cancel, a callback is invoked with the collected answers.

* Data Structures

** Question Object (LLM → Tool)
#+begin_src emacs-lisp
;; Example question plist:
;; (:id "question-1"                    ; Unique identifier (required)
;;  :type "multiple-choice"             ; Question type (required)
;;  :prompt "What is your goal?"        ; Question text (required)
;;  :description "Optional context"     ; Additional detail (optional)
;;  :required t                         ; Whether answer required (default: t)
;;  :default "value"                    ; Default value (optional)
;;  :choices ("Option A" "Option B")    ; For multiple-choice (required if type=multiple-choice)
;;  :min 0                              ; For numeric (optional)
;;  :max 100)                           ; For numeric (optional)
#+end_src

** Answer Object (Tool → LLM)
#+begin_src emacs-lisp
;; Example answer plist returned to LLM:
;; (:id "question-1"                    ; Question identifier
;;  :answer "Option A"                  ; User's answer value
;;  :comment "My reasoning here"        ; Optional user comment
;;  :skipped nil)                       ; Whether skipped (if not required)
#+end_src

** Transient Scope Structure
#+begin_src emacs-lisp
;; Scope structure stored in transient:
;; (:questions (list ...)               ; Original questions from LLM
;;  :answers (hash-table)               ; ID → answer value mapping
;;  :comments (hash-table)              ; ID → comment string mapping
;;  :current-question "question-1")    ; Currently selected (for future nav features)
;;
;; NOTE: Callback is NOT stored in scope to avoid serialization issues.
;;       It's stored in buffer-local variable jf/gptel-questions--callback
#+end_src

* Helper Functions

** Callback Storage

#+begin_src emacs-lisp
(defvar-local jf/gptel-questions--callback nil
  "Buffer-local storage for async tool callback.
Stored outside transient scope to avoid serialization issues.")

(defvar-local jf/gptel-questions--origin-buffer nil
  "Buffer where the tool was originally invoked.
Callback must be invoked in this buffer to access FSM state.")
#+end_src

** Answer Storage and Retrieval

#+begin_src emacs-lisp
(defun jf/gptel-questions--answer-question (question-id answer)
  "Store ANSWER for QUESTION-ID in current scope."
  (let* ((scope (transient-scope))
         (answers (plist-get scope :answers)))
    (puthash question-id answer answers)))

(defun jf/gptel-questions--set-comment (question-id comment)
  "Store COMMENT for QUESTION-ID in current scope."
  (let* ((scope (transient-scope))
         (comments (plist-get scope :comments)))
    (puthash question-id comment comments)))

(defun jf/gptel-questions--get-answer (question-id)
  "Get current answer for QUESTION-ID from scope."
  (let* ((scope (transient-scope))
         (answers (plist-get scope :answers)))
    (gethash question-id answers)))

(defun jf/gptel-questions--get-comment (question-id)
  "Get current comment for QUESTION-ID from scope."
  (let* ((scope (transient-scope))
         (comments (plist-get scope :comments)))
    (gethash question-id comments)))

(defun jf/gptel-questions--is-answered-p (question-id)
  "Check if QUESTION-ID has been answered."
  (let ((answer (jf/gptel-questions--get-answer question-id)))
    (not (null answer))))
#+end_src

** Question Normalization

#+begin_src emacs-lisp
(defun jf/gptel-questions--normalize-question (question)
  "Normalize QUESTION plist from LLM into expected Emacs format.
Handles vector-to-list conversion and type coercion.
Returns normalized question or signals error with clear message."
  (let* ((id (plist-get question :id))
         (type (plist-get question :type))
         (prompt (plist-get question :prompt))
         (description (plist-get question :description))
         (required (plist-get question :required))
         (default (plist-get question :default))
         (choices-raw (plist-get question :choices))
         (min (plist-get question :min))
         (max (plist-get question :max)))

    ;; Validate required fields
    (unless id
      (error "Question missing required field: :id"))
    (unless type
      (error "Question %s missing required field: :type" id))
    (unless prompt
      (error "Question %s missing required field: :prompt" id))

    ;; Validate question type
    (unless (member type '("multiple-choice" "yes-no" "text" "numeric"))
      (error "Question %s has invalid type: %s (must be one of: multiple-choice, yes-no, text, numeric)" id type))

    ;; Type-specific validation and normalization
    (when (string= type "multiple-choice")
      (unless choices-raw
        (error "Question %s is multiple-choice but missing :choices field" id))

      ;; Convert vector to list if needed
      (let ((choices (if (vectorp choices-raw)
                         (append choices-raw nil)
                       choices-raw)))
        (unless (and (listp choices) (> (length choices) 0))
          (error "Question %s :choices must be non-empty array/list, got: %S" id choices-raw))

        ;; Ensure all choices are strings
        (setq choices (mapcar (lambda (c)
                                (if (stringp c)
                                    c
                                  (format "%s" c)))
                              choices))

        ;; Update question with normalized choices
        (setq question (plist-put question :choices choices))))

    (when (string= type "numeric")
      ;; Ensure min/max are numbers if provided
      (when min
        (unless (numberp min)
          (error "Question %s :min must be a number, got: %S" id min)))
      (when max
        (unless (numberp max)
          (error "Question %s :max must be a number, got: %S" id max))))

    ;; Normalize required field to boolean
    ;; Handle JSON false (represented as :json-false)
    (let ((required-normalized
           (cond
            ((eq required :json-false) nil)
            ((null required) t)  ; default to required
            (t (not (null required))))))
      (setq question (plist-put question :required required-normalized)))

    ;; Ensure string fields are strings
    (when description
      (unless (stringp description)
        (setq question (plist-put question :description (format "%s" description)))))
    (when default
      (unless (stringp default)
        (setq question (plist-put question :default (format "%s" default)))))

    question))

(defun jf/gptel-questions--normalize-questions (questions)
  "Normalize QUESTIONS array from LLM.
Converts vectors to lists and validates each question.
Returns list of normalized question plists."
  ;; Convert top-level array
  (let ((questions-list (if (vectorp questions)
                            (append questions nil)
                          questions)))

    (unless (listp questions-list)
      (error "Questions must be an array/list, got: %S" questions))

    (when (= (length questions-list) 0)
      (error "Questions array is empty"))

    ;; Normalize each question
    (mapcar #'jf/gptel-questions--normalize-question questions-list)))
#+end_src

** Validation

#+begin_src emacs-lisp
(defun jf/gptel-questions--validate-answers ()
  "Check if all required questions are answered.
Returns (valid-p . error-message)."
  (let* ((scope (transient-scope))
         (questions (plist-get scope :questions))
         (unanswered-required '()))

    (dolist (q questions)
      (let ((id (plist-get q :id))
            (required (if (plist-member q :required)
                          (plist-get q :required)
                        t)))  ; default to required
        (when (and required
                   (not (jf/gptel-questions--is-answered-p id)))
          (push (plist-get q :prompt) unanswered-required))))

    (if unanswered-required
        (cons nil (format "Required questions unanswered: %s"
                         (string-join (nreverse unanswered-required) ", ")))
      (cons t nil))))
#+end_src

** Answer List Builder

#+begin_src emacs-lisp
(defun jf/gptel-questions--build-answer-list ()
  "Build answer list from current state for callback.
Returns JSON-encoded string for LLM consumption."
  (require 'json)
  (let* ((scope (transient-scope))
         (questions (plist-get scope :questions))
         (answers-hash (plist-get scope :answers))
         (comments-hash (plist-get scope :comments))
         (answer-list '()))

    (dolist (q questions)
      (let* ((id (plist-get q :id))
             (answer (gethash id answers-hash))
             (comment (gethash id comments-hash))
             (skipped (null answer)))
        ;; Use alist format for proper JSON encoding
        (push `((id . ,id)
                (answer . ,(or answer ""))
                (comment . ,(or comment ""))
                (skipped . ,skipped))
              answer-list)))

    ;; Encode as JSON string for gptel tool result serialization
    (json-encode (nreverse answer-list))))
#+end_src

