config/gptel/tools/question-tools.el
;; Example question plist:
;; (:id "question-1"                    ; Unique identifier (required)
;;  :type "multiple-choice"             ; Question type (required)
;;  :prompt "What is your goal?"        ; Question text (required)
;;  :description "Optional context"     ; Additional detail (optional)
;;  :required t                         ; Whether answer required (default: t)
;;  :default "value"                    ; Default value (optional)
;;  :choices ("Option A" "Option B")    ; For multiple-choice (required if type=multiple-choice)
;;  :min 0                              ; For numeric (optional)
;;  :max 100)                           ; For numeric (optional)

;; Example answer plist returned to LLM:
;; (:id "question-1"                    ; Question identifier
;;  :answer "Option A"                  ; User's answer value
;;  :comment "My reasoning here"        ; Optional user comment
;;  :skipped nil)                       ; Whether skipped (if not required)

;; Scope structure stored in transient:
;; (:questions (list ...)               ; Original questions from LLM
;;  :answers (hash-table)               ; ID → answer value mapping
;;  :comments (hash-table)              ; ID → comment string mapping
;;  :callback (function)                ; Async callback
;;  :current-question "question-1")    ; Currently selected (for future nav features)

(defun jf/gptel-questions--answer-question (question-id answer)
  "Store ANSWER for QUESTION-ID in current scope."
  (let* ((scope (transient-scope))
         (answers (plist-get scope :answers)))
    (puthash question-id answer answers)))

(defun jf/gptel-questions--set-comment (question-id comment)
  "Store COMMENT for QUESTION-ID in current scope."
  (let* ((scope (transient-scope))
         (comments (plist-get scope :comments)))
    (puthash question-id comment comments)))

(defun jf/gptel-questions--get-answer (question-id)
  "Get current answer for QUESTION-ID from scope."
  (let* ((scope (transient-scope))
         (answers (plist-get scope :answers)))
    (gethash question-id answers)))

(defun jf/gptel-questions--get-comment (question-id)
  "Get current comment for QUESTION-ID from scope."
  (let* ((scope (transient-scope))
         (comments (plist-get scope :comments)))
    (gethash question-id comments)))

(defun jf/gptel-questions--is-answered-p (question-id)
  "Check if QUESTION-ID has been answered."
  (let ((answer (jf/gptel-questions--get-answer question-id)))
    (not (null answer))))

(defun jf/gptel-questions--validate-answers ()
  "Check if all required questions are answered.
Returns (valid-p . error-message)."
  (let* ((scope (transient-scope))
         (questions (plist-get scope :questions))
         (unanswered-required '()))

    (dolist (q questions)
      (let ((id (plist-get q :id))
            (required (if (plist-member q :required)
                          (plist-get q :required)
                        t)))  ; default to required
        (when (and required
                   (not (jf/gptel-questions--is-answered-p id)))
          (push (plist-get q :prompt) unanswered-required))))

    (if unanswered-required
        (cons nil (format "Required questions unanswered: %s"
                         (string-join (nreverse unanswered-required) ", ")))
      (cons t nil))))

(defun jf/gptel-questions--build-answer-list ()
  "Build answer list from current state for callback."
  (let* ((scope (transient-scope))
         (questions (plist-get scope :questions))
         (answers-hash (plist-get scope :answers))
         (comments-hash (plist-get scope :comments))
         (answer-list '()))

    (dolist (q questions)
      (let* ((id (plist-get q :id))
             (answer (gethash id answers-hash))
             (comment (gethash id comments-hash))
             (skipped (null answer)))
        (push (list :id id
                   :answer (or answer "")
                   :comment (or comment "")
                   :skipped skipped)
              answer-list)))

    (nreverse answer-list)))

(defun jf/gptel-questions--add-or-edit-comment ()
