config/gptel/tools/question-tools.el
  "Interactively select a question and add/edit its comment."
  (interactive)
  (let* ((scope (transient-scope))
         (questions (plist-get scope :questions))
         (choices (mapcar (lambda (q)
                           (let* ((id (plist-get q :id))
                                  (prompt (plist-get q :prompt))
                                  (has-comment (not (string-empty-p
                                                    (jf/gptel-questions--get-comment id))))
                                  (indicator (if has-comment "💬 " "")))
                             (cons (format "%s%s" indicator prompt) id)))
                         questions))
         (selection (completing-read "Add/edit comment for: " choices nil t))
         (question-id (cdr (assoc selection choices))))

    (when question-id
      (let* ((current-comment (jf/gptel-questions--get-comment question-id))
             (new-comment (read-string "Comment: " current-comment)))
        (jf/gptel-questions--set-comment question-id new-comment)
        (message "Comment saved for: %s" selection)))))

(defun jf/gptel-questions--format-question (question key)
  "Format QUESTION for display in transient menu with KEY binding."
  (let* ((prompt (plist-get question :prompt))
         (required (if (plist-member question :required)
                       (plist-get question :required)
                     t))
         (id (plist-get question :id))
         (answered (jf/gptel-questions--is-answered-p id))
         (answer (jf/gptel-questions--get-answer id))
         (comment (jf/gptel-questions--get-comment id))
         (has-comment (and comment (not (string-empty-p comment))))
         (indicator (cond
                     (answered (propertize "✓" 'face 'success))
                     (required (propertize "●" 'face 'error))
                     (t (propertize "○" 'face 'transient-inactive-value))))
         (comment-indicator (if has-comment
                                (propertize " 💬" 'face 'transient-value)
                              ""))
         (key-str (propertize (format "[%s]" key) 'face 'transient-key)))

    (format "%s %s %s%s%s"
            key-str
            indicator
            prompt
            (if answered
                (propertize (format " → %s" answer) 'face 'transient-value)
              "")
            comment-indicator)))

(defun jf/gptel-questions--progress-info ()
  "Generate progress indicator string."
  (let* ((scope (transient-scope))
         (questions (plist-get scope :questions))
         (total (length questions))
         (answered (cl-count-if
                    (lambda (q)
                      (jf/gptel-questions--is-answered-p (plist-get q :id)))
                    questions))
         (face (if (= answered total) 'success 'transient-value)))
    (propertize (format "Progress: %d/%d answered" answered total)
                'face face)))

(defun jf/gptel-questions--submit ()
  "Validate and submit answers."
  (interactive)
  (let ((validation (jf/gptel-questions--validate-answers)))
    (if (car validation)
        (let* ((scope (transient-scope))
               (callback (plist-get scope :callback))
               (answer-list (jf/gptel-questions--build-answer-list)))

          ;; Invoke callback
          (funcall callback answer-list)

          ;; Close transient
          (transient-quit-one))

      ;; Validation failed
      (message "%s" (cdr validation)))))

(defun jf/gptel-questions--cancel ()
  "Cancel and return partial answers to LLM."
  (interactive)
  (let* ((scope (transient-scope))
         (callback (plist-get scope :callback))
         (answer-list (jf/gptel-questions--build-answer-list)))

    ;; Invoke callback with partial answers
    (funcall callback answer-list)

    ;; Close transient
    (transient-quit-one)))

(defclass jf/gptel-question-infix (transient-infix)
  ((question :initarg :question))
  "Infix class for question answering.")

(cl-defmethod transient-infix-read ((obj jf/gptel-question-infix))
  "Read answer for question OBJ based on question type."
  (let* ((q (oref obj question))
         (q-type (plist-get q :type))
         (q-id (plist-get q :id))
         (prompt (plist-get q :prompt))
         (default (plist-get q :default))
         (current (jf/gptel-questions--get-answer q-id)))

    (pcase q-type
      ("multiple-choice"
       (let ((choices (plist-get q :choices)))
         (completing-read (format "%s: " prompt)
                         choices nil t (or current default))))

      ("yes-no"
       (if (y-or-n-p (format "%s " prompt)) "yes" "no"))

      ("text"
       (read-string (format "%s: " prompt) (or current default)))

      ("numeric"
       (let* ((min (plist-get q :min))
              (max (plist-get q :max))
              (default-val (or (and current (string-to-number current))
                              default
                              0))
              (input (read-number (format "%s: " prompt) default-val)))
         (when (and min (< input min))
           (error "Value must be at least %d" min))
         (when (and max (> input max))
           (error "Value must be at most %d" max))
         (number-to-string input)))

      (_ (error "Unknown question type: %s" q-type)))))

(cl-defmethod transient-infix-set ((obj jf/gptel-question-infix) value)
  "Set VALUE as answer for question OBJ."
  (let ((q-id (plist-get (oref obj question) :id)))
    (jf/gptel-questions--answer-question q-id value)
    (oset obj value value)))

(cl-defmethod transient-format ((obj jf/gptel-question-infix))
  "Format question and answer for display."
  (let* ((q (oref obj question))
         (key (oref obj key))
         (formatted (jf/gptel-questions--format-question q key)))
    (format "  %s" formatted)))

(defun jf/gptel-questions--generate-key-pool (count)
  "Generate COUNT key bindings for questions.
Uses single letters (a-z) for first 26, then two-letter combinations (aa-zz)."
  (let ((keys '())
        (letters "abcdefghijklmnopqrstuvwxyz"))
    ;; Single letters: a-z (26 keys)
    (dotimes (i (min count 26))
      (push (substring letters i (1+ i)) keys))

    ;; Two letters: aa-zz (676 more keys if needed)
    (when (> count 26)
      (dotimes (i (min (- count 26) 676))
        (let ((first (/ i 26))
              (second (mod i 26)))
          (push (format "%c%c"
                        (aref letters first)
                        (aref letters second))
                keys))))

    (nreverse keys)))

(defun jf/gptel-questions--setup-question-suffixes (_)
