config/gptel/tools/question-tools.org
** Dynamic Suffix Generation

#+begin_src emacs-lisp
(defun jf/gptel-questions--setup-question-suffixes (_)
  "Generate transient suffixes for each question."
  (let* ((scope (transient-scope))
         (questions (plist-get scope :questions))
         (key-pool (jf/gptel-questions--generate-key-pool (length questions))))

    (transient-parse-suffixes
     'jf/gptel-questions-menu
     (cl-loop for q in questions
              for key in key-pool
              collect
              (list key
                    ""  ; Description computed dynamically by transient-format
                    (plist-get q :id)  ; Use question ID as the argument
                    :class 'jf/gptel-question-infix
                    :question q)))))
#+end_src

** Main Prefix

#+begin_src emacs-lisp
(transient-define-prefix jf/gptel-questions-menu ()
  "Answer questions from LLM agent."
  :refresh-suffixes t

  ;; Top section: Info and actions
  [:description "Answer Questions"
   [""
    (:info (lambda () (jf/gptel-questions--progress-info)))]
   [""
    ("RET" "Submit answers" jf/gptel-questions--submit)
    ("C" "Add/edit comment" jf/gptel-questions--add-or-edit-comment
     :transient t)
    ("q" "Cancel (send partial)" jf/gptel-questions--cancel)]]

  ;; Questions section: dynamically generated
  [[:class transient-column
    :setup-children jf/gptel-questions--setup-question-suffixes]])
#+end_src

* Tool Definition

** Tool Entry Point

#+begin_src emacs-lisp
(defun jf/gptel-questions--ask (callback questions)
  "Async tool function. Display questions UI and invoke CALLBACK with answers.
QUESTIONS is array of question plists from LLM.

Normalizes and validates questions before displaying UI.
Signals clear errors if questions are malformed."
  (message "=== TOOL INVOCATION START ===")
  (message "Entry buffer: %s (mode: %s)" (current-buffer) major-mode)
  (message "gptel--fsm bound: %s" (boundp 'gptel--fsm))
  (when (boundp 'gptel--fsm)
    (message "FSM state: %s" (plist-get gptel--fsm :state)))

  (condition-case err
      (let* ((origin-buffer (current-buffer))  ; Capture IMMEDIATELY
             ;; Normalize and validate questions
             (questions-list (jf/gptel-questions--normalize-questions questions))
             (answers (make-hash-table :test 'equal))
             (comments (make-hash-table :test 'equal)))

        (message "→ Captured origin: %s" origin-buffer)

        ;; Initialize hash tables
        (dolist (q questions-list)
          (puthash (plist-get q :id) nil answers)
          (puthash (plist-get q :id) "" comments))

        ;; Store callback and origin buffer in buffer-local variables (NOT in transient scope)
        ;; This avoids serialization issues when gptel tries to serialize state
        ;; Origin buffer needed so callback can access FSM state
        ;; CRITICAL: Use captured origin-buffer, not (current-buffer) which may have changed
        (setq-local jf/gptel-questions--callback callback)
        (setq-local jf/gptel-questions--origin-buffer origin-buffer)
        (message "→ Stored callback in: %s" (current-buffer))

        ;; Launch transient with scope (callback and origin buffer NOT included)
        (transient-setup
         'jf/gptel-questions-menu
         nil nil
         :scope (list :questions questions-list
                      :answers answers
                      :comments comments
                      :current-question (plist-get (car questions-list) :id))))

    ;; Handle errors gracefully - provide structured feedback to LLM
    (error
     (require 'json)
     (let ((error-msg (error-message-string err)))
       (message "Error in ask_questions tool: %s" error-msg)
       (message "This is likely due to malformed question structure from LLM")
       (message "Questions received: %S" questions)
       ;; Return validation error to LLM as JSON string so it can correct the tool call
       ;; Use alist format for proper JSON encoding
       (funcall callback
                (json-encode
                 (list `((error . t)
                        (error_type . "validation_error")
                        (error_message . ,error-msg)
                        (hint . "Check that all questions have required fields (:id, :type, :prompt), :type is valid (multiple-choice/yes-no/text/numeric), and multiple-choice questions include :choices array")))))))))
#+end_src

** Tool Registration

#+begin_src emacs-lisp
(gptel-make-tool
 :name "ask_questions"
 :function #'jf/gptel-questions--ask

 :description "Ask user structured questions and collect answers interactively.

Present multiple questions in an interactive menu where user can:
- Answer in any order
- Add optional comments/notes to answers
- See progress (answered vs total)
- Review and change answers before submission
- Submit when ready or cancel to return partial answers

Question types supported:
- multiple-choice: User selects from predefined choices list
- yes-no: Simple yes/no question
- text: Free-form text input
- numeric: Numeric input with optional min/max validation

Use this when you need user input to refine your plan or make decisions.
For example, ask about goals, constraints, preferences, or technical choices."

 :args '((:name "questions"
          :type "array"
          :items (:type "object"
                  :properties (:id (:type "string"
                                   :description "Unique question identifier")
                              :type (:type "string"
                                    :enum ["multiple-choice" "yes-no" "text" "numeric"]
                                    :description "Question type")
                              :prompt (:type "string"
                                      :description "Question text to display")
                              :description (:type "string"
                                           :description "Optional additional context")
                              :required (:type "boolean"
                                        :description "Whether answer is required (default: true)")
                              :default (:type "string"
                                       :description "Default answer value")
                              :choices (:type "array"
                                       :items (:type "string")
                                       :description "For multiple-choice: list of options")
                              :min (:type "number"
                                   :description "For numeric: minimum value")
                              :max (:type "number"
                                   :description "For numeric: maximum value")))
          :description "Array of question objects to ask user"))

 :category "interaction"
 :async t
 :confirm nil)
#+end_src

* Testing Utilities

