config/gptel/tools/question-tools.el
  "Generate transient suffixes for each question."
  (let* ((scope (transient-scope))
         (questions (plist-get scope :questions))
         (key-pool (jf/gptel-questions--generate-key-pool (length questions))))

    (transient-parse-suffixes
     'jf/gptel-questions-menu
     (cl-loop for q in questions
              for key in key-pool
              collect
              (list key
                    ""  ; Description computed dynamically by transient-format
                    (plist-get q :id)  ; Use question ID as the argument
                    :class 'jf/gptel-question-infix
                    :question q)))))

(transient-define-prefix jf/gptel-questions-menu ()
  "Answer questions from LLM agent."
  :refresh-suffixes t

  ;; Top section: Info and actions
  [:description "Answer Questions"
   [""
    (:info (lambda () (jf/gptel-questions--progress-info)))]
   [""
    ("RET" "Submit answers" jf/gptel-questions--submit)
    ("C" "Add/edit comment" jf/gptel-questions--add-or-edit-comment
     :transient t)
    ("q" "Cancel (send partial)" jf/gptel-questions--cancel)]]

  ;; Questions section: dynamically generated
  [[:class transient-column
    :setup-children jf/gptel-questions--setup-question-suffixes]])

(defun jf/gptel-questions--ask (callback questions)
  "Async tool function. Display questions UI and invoke CALLBACK with answers.
QUESTIONS is array of question plists from LLM."
  (let ((answers (make-hash-table :test 'equal))
        (comments (make-hash-table :test 'equal)))
    ;; Initialize hash tables
    (dolist (q questions)
      (puthash (plist-get q :id) nil answers)
      (puthash (plist-get q :id) "" comments))

    ;; Launch transient with scope
    (transient-setup
     'jf/gptel-questions-menu
     nil nil
     :scope (list :questions questions
                  :answers answers
                  :comments comments
                  :callback callback
                  :current-question (plist-get (car questions) :id)))))

(gptel-make-tool
 :name "ask_questions"
 :function #'jf/gptel-questions--ask

 :description "Ask user structured questions and collect answers interactively.

Present multiple questions in an interactive menu where user can:
- Answer in any order
- Add optional comments/notes to answers
- See progress (answered vs total)
- Review and change answers before submission
- Submit when ready or cancel to return partial answers

Question types supported:
- multiple-choice: User selects from predefined choices list
- yes-no: Simple yes/no question
- text: Free-form text input
- numeric: Numeric input with optional min/max validation

Use this when you need user input to refine your plan or make decisions.
For example, ask about goals, constraints, preferences, or technical choices."

 :args '((:name "questions"
          :type array
          :items (:type object
                  :properties (:id (:type string
                                   :description "Unique question identifier")
                              :type (:type string
                                    :enum ["multiple-choice" "yes-no" "text" "numeric"]
                                    :description "Question type")
                              :prompt (:type string
                                      :description "Question text to display")
                              :description (:type string
                                           :description "Optional additional context")
                              :required (:type boolean
                                        :description "Whether answer is required (default: true)")
                              :default (:type string
                                       :description "Default answer value")
                              :choices (:type array
                                       :items (:type string)
                                       :description "For multiple-choice: list of options")
                              :min (:type number
                                   :description "For numeric: minimum value")
                              :max (:type number
                                   :description "For numeric: maximum value")))
          :description "Array of question objects to ask user"))

 :category "interaction"
 :async t
 :confirm nil)
