config/gptel/tools/question-tools.org
** Manual Test Cases

These functions can be used to manually test the question tool.

#+begin_src emacs-lisp
(defun jf/gptel-questions-test-basic ()
  "Test basic functionality with text, yes-no, and multiple-choice."
  (interactive)
  (jf/gptel-questions--ask
   (lambda (answers-json)
     (message "Answers JSON: %s" answers-json)
     (message "Parsed: %S" (json-read-from-string answers-json)))
   '((:id "test1" :type "text" :prompt "Your name?" :required t)
     (:id "test2" :type "yes-no" :prompt "Proceed?")
     (:id "test3" :type "multiple-choice"
      :prompt "Choose color"
      :choices ("Red" "Blue" "Green")))))

(defun jf/gptel-questions-test-numeric ()
  "Test numeric validation with min/max."
  (interactive)
  (jf/gptel-questions--ask
   (lambda (answers-json)
     (message "Answers JSON: %s" answers-json))
   '((:id "age" :type "numeric" :prompt "Age?" :min 0 :max 120 :required t))))

(defun jf/gptel-questions-test-optional ()
  "Test optional fields with defaults."
  (interactive)
  (jf/gptel-questions--ask
   (lambda (answers-json)
     (message "Answers JSON: %s" answers-json))
   '((:id "opt1" :type "text" :prompt "Optional field"
      :required nil :default "Default value"))))

(defun jf/gptel-questions-test-large ()
  "Test with 15 questions to verify scrolling."
  (interactive)
  (jf/gptel-questions--ask
   (lambda (answers-json)
     (let ((answers (json-read-from-string answers-json)))
       (message "Got %d answers" (length answers))))
   (cl-loop for i from 1 to 15
            collect (list :id (format "q%d" i)
                         :type "text"
                         :prompt (format "Question %d?" i)
                         :required nil))))

(defun jf/gptel-questions-test-realistic ()
  "Test with realistic planning scenario questions."
  (interactive)
  (jf/gptel-questions--ask
   (lambda (answers-json)
     (let ((answers (json-read-from-string answers-json)))
       (message "Planner received %d answers" (length answers))
       (dolist (a answers)
         (let-alist a
           (message "  %s: %s%s"
                    .id
                    .answer
                    (if (string-empty-p .comment)
                        ""
                      (format " [%s]" .comment)))))))
   '((:id "primary_goal"
      :type "multiple-choice"
      :prompt "What is your primary goal for this feature?"
      :description "This helps me prioritize design trade-offs"
      :choices ("Performance" "Readability" "Maintainability" "Simplicity")
      :required t)
     (:id "refactor_existing"
      :type "yes-no"
      :prompt "Should I refactor existing code or leave it as-is?"
      :required t)
     (:id "deadline"
      :type "text"
      :prompt "When do you need this completed?"
      :required nil
      :default "No specific deadline")
     (:id "complexity_tolerance"
      :type "numeric"
      :prompt "Complexity tolerance (1=simple, 10=complex)"
      :description "Higher values mean more sophisticated solutions"
      :min 1
      :max 10
      :default "5"
      :required nil))))
#+end_src

** Robustness Tests

#+begin_src emacs-lisp
(defun jf/gptel-questions-test-vector-choices ()
  "Test that vector choices (from LLM JSON) work correctly."
  (interactive)
  (jf/gptel-questions--ask
   (lambda (answers-json)
     (message "Answers JSON: %s" answers-json))
   ;; Simulate JSON array as vector
   [(:id "test1" :type "multiple-choice"
     :prompt "Choose option"
     :choices ["Option A" "Option B" "Option C"]  ; Vector, not list
     :required t)]))

(defun jf/gptel-questions-test-json-false ()
  "Test that :json-false for required field works correctly."
  (interactive)
  (jf/gptel-questions--ask
   (lambda (answers-json)
     (message "Answers JSON: %s" answers-json))
   [(:id "test1" :type "text"
     :prompt "Optional field"
     :required :json-false)]))  ; JSON false becomes :json-false

(defun jf/gptel-questions-test-malformed ()
  "Test error handling for malformed questions."
  (interactive)
  ;; Missing :id
  (condition-case err
      (jf/gptel-questions--ask
       (lambda (answers) (message "Should not reach here"))
       [(:type "text" :prompt "No ID")])
    (error (message "Correctly caught error: %s" (error-message-string err))))

  ;; Missing :type
  (condition-case err
      (jf/gptel-questions--ask
       (lambda (answers) (message "Should not reach here"))
       [(:id "test" :prompt "No type")])
    (error (message "Correctly caught error: %s" (error-message-string err))))

  ;; Multiple-choice without choices
  (condition-case err
      (jf/gptel-questions--ask
       (lambda (answers) (message "Should not reach here"))
       [(:id "test" :type "multiple-choice" :prompt "No choices")])
    (error (message "Correctly caught error: %s" (error-message-string err)))))

(defun jf/gptel-questions-test-type-coercion ()
  "Test that non-string values get coerced to strings."
  (interactive)
  (jf/gptel-questions--ask
   (lambda (answers-json)
     (message "Answers JSON: %s" answers-json))
   [(:id "test1" :type "multiple-choice"
     :prompt "Choose number"
     :choices [1 2 3]  ; Numbers, should be coerced to strings
     :required t)
    (:id "test2" :type "text"
     :prompt "Text field"
     :default 42)]))  ; Number default, should be coerced

(defun jf/gptel-questions-test-error-feedback ()
  "Test that validation errors are returned to LLM callback in structured format."
  (interactive)
  ;; This simulates what the LLM would receive when providing malformed questions
  (jf/gptel-questions--ask
   (lambda (result-json)
     (let ((result (json-read-from-string result-json)))
       (if (alist-get 'error (elt result 0))
           (let-alist (elt result 0)
             (message "LLM received validation error:")
             (message "  Error type: %s" .error_type)
             (message "  Error message: %s" .error_message)
             (message "  Hint: %s" .hint))
         (message "LLM received valid answers: %S" result))))
   ;; Invalid question: missing :type field
   [(:id "test" :prompt "Question without type field")]))
#+end_src

* Implementation Notes and Known Issues

** Background

This async gptel tool uses transient for UI and must integrate with gptel's FSM (finite state machine) for tool execution. The implementation faced several challenges due to the interaction between transient's scope management and gptel's request serialization.

** Challenge 1: Data Structure Serialization

*** Problem
When returning tool results to the LLM, gptel serializes the request context (including tool results) to send to the API. Initial implementations encountered errors:

#+begin_example
(wrong-type-argument symbolp "User documentation (how-to guides, tutorials)")
#+end_example

*** Root Cause
Emacs ~json-encode~ doesn't handle plists correctly - it treats them as flat arrays instead of objects:

#+begin_src emacs-lisp :tangle no
;; This plist:
'(:id "test" :answer "foo")

;; Gets encoded as:
{"id": ["test", "answer", "foo"]}  ; Wrong!

;; Instead of:
{"id": "test", "answer": "foo"}    ; Correct
#+end_src

*** Solution
Convert to alists before JSON encoding:

#+begin_src emacs-lisp :tangle no
;; Use alist format for proper JSON encoding
`((id . ,id)
  (answer . ,(or answer ""))
  (comment . ,(or comment ""))
  (skipped . ,skipped))
#+end_src

** Challenge 2: Callback in Transient Scope

*** Problem
Initially stored the callback function in the transient scope:

#+begin_src emacs-lisp :tangle no
:scope (list :questions questions-list
             :answers answers
             :comments comments
             :callback callback)  ; PROBLEM: callback in scope
#+end_src

This caused serialization errors because when gptel tried to serialize the request context after the tool completed, it encountered the transient scope data (including question choices, hash tables, etc.) embedded in the callback's closure.

Error: ~(wrong-type-argument symbolp "Code implementation or refactoring")~

*** Root Cause
The callback is a closure that captures gptel's request context. When we stored it in the transient scope, we created a circular reference or unexpected data structure that gptel's serialization couldn't handle. Specifically:

1. Callback captures gptel request info (including buffer, position, data)
2. We stored callback in transient scope
3. Transient scope contains all our UI data (questions with choice arrays, hash tables)
4. When tool completes, gptel tries to serialize context to send results back
5. Serialization encounters transient scope data where it expects simple values

*** Solution
Store callback in buffer-local variable **outside** transient scope:

#+begin_src emacs-lisp :tangle no
;; Store callback separately
(setq-local jf/gptel-questions--callback callback)

;; Don't include in scope
:scope (list :questions questions-list
             :answers answers
             :comments comments)  ; callback NOT here
#+end_src

** Challenge 3: Callback Invocation and FSM Continuation (IN PROGRESS)

*** Problem Evolution

**** Issue 1: Closure Scoping (SOLVED)
Initial implementation failed with ~(void-variable hook-fn)~ errors.

**Root cause:** Missing ~lexical-binding: t~ header in tangled .el file.
- Without lexical binding, Emacs uses dynamic scoping
- Closures cannot capture variables from enclosing scope
- Self-referential lambdas (hooks that remove themselves) fail

**Solution:** Added file header ~;;; -*- lexical-binding: t -*-~ to enable lexical closures.

**** Issue 2: FSM Not Continuing (CURRENT)
Tool UI works, callback is invoked, tool results appear in buffer, but LLM doesn't respond.

**Observable behavior:**
- Transient menu appears ✓
- User can answer questions ✓
- Submit triggers post-command hook ✓
- Callback is invoked ✓
- Tool result appears in gptel buffer ✓
- FSM does NOT continue to send results back to LLM ✗

**Example tool result visible in buffer:**
#+begin_example
[{"id":"task_type","answer":"Debug or fix an issue","comment":"","skipped":null}]
#+end_example

**What should happen next (but doesn't):**
1. Tool result stored in FSM state
2. GPtel makes follow-up API request with tool results
3. LLM responds with final answer incorporating user's answers

*** Current Hypothesis: Buffer Context Issue

The ~process-tool-result~ closure (callback parameter) likely requires execution in the
**originating gptel buffer context** to properly access FSM state and trigger transitions.

**Current implementation problem:**
1. Tool invoked in gptel buffer A
2. Callback stored as buffer-local variable in buffer A
3. Transient may run in buffer A or separate buffer
4. Post-command hook runs in *current buffer* (wherever transient quit)
5. Callback invoked without ensuring we're in buffer A
6. Callback cannot access buffer-local FSM state → FSM doesn't transition

**Supporting evidence:**
- Working async tool (~persistent-agent~) invokes callback from within gptel's own
  callback infrastructure, which manages buffer context automatically
- Our tool invokes callback from user command context after transient cleanup
- GPtel FSM state is buffer-local in the originating gptel buffer

*** Proposed Solution: Buffer Context Preservation

Store originating buffer and restore context before invoking callback:

#+begin_src emacs-lisp :tangle no
;; In jf/gptel-questions--ask:
(setq-local jf/gptel-questions--callback callback)
(setq-local jf/gptel-questions--origin-buffer (current-buffer))  ; NEW

;; In jf/gptel-questions--submit:
(let ((answer-json (jf/gptel-questions--build-answer-list))
      (callback jf/gptel-questions--callback)
      (origin-buffer jf/gptel-questions--origin-buffer))  ; NEW

  (transient-quit-one)

  (let (hook-fn)
    (setq hook-fn
          (lambda ()
            (remove-hook 'post-command-hook hook-fn)
            (condition-case err
                (progn
                  (message "Invoking callback with: %s" answer-json)
                  ;; NEW: Invoke in originating buffer context
                  (with-current-buffer origin-buffer
                    (funcall callback answer-json)))
              (error
               (message "Error in callback: %s" (error-message-string err))
               (message "Answer JSON was: %s" answer-json)))))
    (add-hook 'post-command-hook hook-fn)))
#+end_src

