config/gptel/tools/question-tools.el

(defun jf/gptel-questions-test-basic ()
  "Test basic functionality with text, yes-no, and multiple-choice."
  (interactive)
  (jf/gptel-questions--ask
   (lambda (answers) (message "Answers: %S" answers))
   '((:id "test1" :type "text" :prompt "Your name?" :required t)
     (:id "test2" :type "yes-no" :prompt "Proceed?")
     (:id "test3" :type "multiple-choice"
      :prompt "Choose color"
      :choices ("Red" "Blue" "Green")))))

(defun jf/gptel-questions-test-numeric ()
  "Test numeric validation with min/max."
  (interactive)
  (jf/gptel-questions--ask
   (lambda (answers) (message "Answers: %S" answers))
   '((:id "age" :type "numeric" :prompt "Age?" :min 0 :max 120 :required t))))

(defun jf/gptel-questions-test-optional ()
  "Test optional fields with defaults."
  (interactive)
  (jf/gptel-questions--ask
   (lambda (answers) (message "Answers: %S" answers))
   '((:id "opt1" :type "text" :prompt "Optional field"
      :required nil :default "Default value"))))

(defun jf/gptel-questions-test-large ()
  "Test with 15 questions to verify scrolling."
  (interactive)
  (jf/gptel-questions--ask
   (lambda (answers) (message "Got %d answers" (length answers)))
   (cl-loop for i from 1 to 15
            collect (list :id (format "q%d" i)
                         :type "text"
                         :prompt (format "Question %d?" i)
                         :required nil))))

(defun jf/gptel-questions-test-realistic ()
  "Test with realistic planning scenario questions."
  (interactive)
  (jf/gptel-questions--ask
   (lambda (answers)
     (message "Planner received %d answers" (length answers))
     (dolist (a answers)
       (message "  %s: %s%s"
                (plist-get a :id)
                (plist-get a :answer)
                (if (string-empty-p (plist-get a :comment))
                    ""
                  (format " [%s]" (plist-get a :comment))))))
   '((:id "primary_goal"
      :type "multiple-choice"
      :prompt "What is your primary goal for this feature?"
      :description "This helps me prioritize design trade-offs"
      :choices ("Performance" "Readability" "Maintainability" "Simplicity")
      :required t)
     (:id "refactor_existing"
      :type "yes-no"
      :prompt "Should I refactor existing code or leave it as-is?"
      :required t)
     (:id "deadline"
      :type "text"
      :prompt "When do you need this completed?"
      :required nil
      :default "No specific deadline")
     (:id "complexity_tolerance"
      :type "numeric"
      :prompt "Complexity tolerance (1=simple, 10=complex)"
      :description "Higher values mean more sophisticated solutions"
      :min 1
      :max 10
      :default "5"
      :required nil))))
