config/gptel/tools/question-tools.org
*** Research Questions

To validate hypothesis and solution:

1. **Which buffer is current when callback executes?**
   - Add debug logging: ~(message "Callback buffer: %s" (current-buffer))~
   - Compare to originating gptel buffer name

2. **Does gptel FSM state exist in callback buffer?**
   - Check buffer-local variables related to gptel requests/FSM
   - Look for ~gptel--*~ buffer-local variables

3. **What does ~process-tool-result~ closure expect?**
   - Examine ~gptel-request.el:1700-1713~ to understand closure implementation
   - What buffer-local state does it access?
   - Does it call ~gptel--fsm-transition~ directly or schedule it?

4. **Does ~persistent-agent~ tool handle buffer context explicitly?**
   - Review ~config/gptel/tools/persistent-agent.el:220-272~
   - How does it ensure callback runs in correct buffer?

5. **Can we trace FSM transitions?**
   - Enable ~(setq gptel-log-level 'debug)~
   - Look for FSM state changes in ~*gptel-log*~ buffer
   - Expected: TOOL → WAIT → (should see follow-up request)
   - Actual: TOOL → nothing

*** Debugging Steps

#+begin_src emacs-lisp :tangle no
;; 1. Enable gptel debug logging
(setq gptel-log-level 'debug)

;; 2. Add buffer context logging to submit function
(defun jf/gptel-questions--submit ()
  "Validate and submit answers."
  (interactive)
  (let ((validation (jf/gptel-questions--validate-answers)))
    (if (car validation)
        (let* ((answer-json (jf/gptel-questions--build-answer-list))
               (callback jf/gptel-questions--callback)
               (origin-buffer (current-buffer)))  ; Capture current buffer

          (message "Origin buffer: %s" origin-buffer)  ; DEBUG

          (transient-quit-one)

          (let (hook-fn)
            (setq hook-fn
                  (lambda ()
                    (remove-hook 'post-command-hook hook-fn)
                    (message "Callback buffer: %s" (current-buffer))  ; DEBUG
                    (message "Origin buffer: %s" origin-buffer)       ; DEBUG
                    (condition-case err
                        (progn
                          (message "Invoking callback with: %s" answer-json)
                          (funcall callback answer-json))
                      (error
                       (message "Error in callback: %s" (error-message-string err))
                       (message "Answer JSON was: %s" answer-json)))))
            (add-hook 'post-command-hook hook-fn)))

      (message "%s" (cdr validation)))))

;; 3. Test and check *Messages* buffer for:
;;    - "Origin buffer: *gptel*"
;;    - "Callback buffer: *gptel*" or different?

;; 4. Check *gptel-log* buffer for FSM transitions after tool result
#+end_src

*** Files to Study

- ~gptel-request.el:1700-1713~ - ~process-tool-result~ closure implementation
- ~gptel-request.el:1564-1582~ - FSM transition table and state machine
- ~gptel-request.el:1679-1747~ - ~gptel--handle-tool-use~ (async tool execution)
- ~config/gptel/tools/persistent-agent.el:220-272~ - Working async tool for comparison

*** Key Architectural Insights

1. **Lexical binding is mandatory** for closures to work correctly in Elisp
2. **Post-command hooks run in current buffer** - not guaranteed to be originating buffer
3. **GPtel FSM state is buffer-local** - callbacks must execute in correct buffer context
4. **Async tool callbacks** are ~process-tool-result~ closures that manage FSM state
5. **Transient cleanup** must complete before FSM operations (confirmed working)

*** Current Status

- ✓ Tool UI fully functional
- ✓ Question answering and validation working
- ✓ JSON serialization working
- ✓ Callback storage outside transient scope working
- ✓ Lexical binding enabled
- ✓ Post-command hook pattern working (callback invokes)
- ✗ FSM continuation failing (no follow-up LLM request)

**Next step:** Implement buffer context preservation and test hypothesis.

*** Debugging Session: January 2026 - FSM Integration Attempts

**** Problem Statement

After implementing buffer context preservation and callback invocation, the tool still fails
to continue the GPtel conversation after returning results. The conversation stops after the
tool result is captured.

**** Key Observations

**1. FSM Not Present in Buffer**

~gptel--fsm~ is consistently ~nil~ in the session.md buffer when the tool is invoked:

#+begin_example
=== TOOL INVOCATION START ===
Entry buffer: session.md (mode: markdown-mode)
gptel--fsm bound: nil
#+end_example

However, examining the callback structure reveals the FSM IS embedded in the callback closure
as the last element: ~#s(gptel-fsm TOOL ...)~

This suggests gptel does NOT use a buffer-local FSM variable, but rather passes FSM state
through callback closures.

**2. Error Shows Choice Strings, Not User Answers**

Critical observation: The error message references strings from the question's ~:choices~ array,
NOT the user's selected answer:

#+begin_example
User selected: "Summer - Warm weather and long days"
Error message: Wrong type argument: symbolp, "Spring - Fresh beginnings and flowers blooming"
#+end_example

"Spring" is a choice from the ~:choices~ array, not the answer. This indicates the error occurs
when GPtel processes the ORIGINAL tool call arguments (the question definition), not when
processing the tool RESULT (the user's answer).

**3. Tool Schema Type Issue**

Initial tool schema used symbol types instead of string types:

#+begin_src emacs-lisp :tangle no
;; WRONG - causes type errors
:args '((:name "questions"
         :type array          ; Should be "array"
         :items (:type object ; Should be "object"
#+end_src

Fixed to use string types:

#+begin_src emacs-lisp :tangle no
;; CORRECT
:args '((:name "questions"
         :type "array"
         :items (:type "object"
#+end_src

However, the error persists even after this fix, suggesting either:
- The tool definition wasn't actually reloaded
- The error occurs in a different part of the schema serialization
- There's a deeper incompatibility with how GPtel serializes tool schemas

**** Attempted Solutions

**Attempt 1: Synchronous Callback (Before Quit)**

Strategy: Invoke callback immediately before closing transient to ensure FSM is still active.

#+begin_src emacs-lisp :tangle no
(funcall callback answer-json)  ; Call first
(transient-quit-one)            ; Then close
#+end_src

Result: ERROR - "Wrong type argument: symbolp" on choice string. User reported that calling
callback before closing transient causes "extra stuff" to be passed back, likely due to
transient state contamination.

**Attempt 2: Post-Command Hook Deferral**

Strategy: Close transient first, then defer callback via ~post-command-hook~.

#+begin_src emacs-lisp :tangle no
(transient-quit-one)           ; Close first

(let (hook-fn)
  (setq hook-fn
        (lambda ()
          (remove-hook 'post-command-hook hook-fn)
          (funcall callback answer-json)))
  (add-hook 'post-command-hook hook-fn))
#+end_src

Result: ERROR - Same error. Post-command-hook runs after transient cleanup but FSM context
may be stale by that point.

**Attempt 3: Timer-Based Deferral**

Strategy: Close transient first, then use ~run-at-time~ with short delay to invoke callback
after transient cleanup completes.

#+begin_src emacs-lisp :tangle no
(transient-quit-one)           ; Close first

(run-at-time
 0.05 nil                      ; 50ms delay
 (lambda ()
   (funcall callback answer-json)))
#+end_src

Result: ERROR - Same error persists. Timer allows transient to fully clean up but doesn't
resolve the underlying type error.

**Attempt 4: Buffer Context Preservation**

Strategy: Capture origin buffer immediately at tool entry, store as buffer-local, and use
it when invoking callback.

#+begin_src emacs-lisp :tangle no
;; In jf/gptel-questions--ask:
(let* ((origin-buffer (current-buffer))  ; Capture immediately
       ...)
  (setq-local jf/gptel-questions--origin-buffer origin-buffer))

;; In jf/gptel-questions--submit:
(with-current-buffer origin-buffer
  (funcall callback answer-json))
#+end_src

Result: ERROR - Same error. Buffer context is correct (session.md), but ~gptel--fsm~ is
still nil in that buffer, confirming FSM is not buffer-local.

**** Current Understanding

1. **FSM is NOT buffer-local** - It's passed through callback closures, not stored in buffers
2. **Error occurs during schema serialization** - The error references choice strings from
   the tool schema, not the user's answer
3. **Callback structure appears correct** - The callback contains the FSM and is being invoked
   correctly
4. **Type error in schema** - Despite fixing type declarations from symbols to strings,
   the error persists, suggesting:
   - Tool wasn't reloaded properly, OR
   - There's additional schema issues we haven't found, OR
   - GPtel's serialization has different requirements we're not meeting

**** Open Questions

1. Why does the error reference choice strings instead of the answer?
   - Hypothesis: Error occurs when GPtel re-serializes the original tool call arguments
     to include in the next API request message history

2. Why does ~gptel--fsm bound: nil~ if FSM is in the callback?
   - Hypothesis: GPtel doesn't use buffer-local FSM, only closure-based FSM

3. Are there additional type issues in the schema?
   - Need to verify ALL type declarations use strings
   - Check if ~:enum~ vectors need special handling

4. Is the tool definition actually being reloaded?
   - ~M-x jf/reload-module~ may not fully re-register the tool
   - May need to clear gptel's tool cache manually

**** Next Debugging Steps

1. **Verify tool reload**: Check ~gptel--known-tools~ to confirm new schema is registered
2. **Test minimal tool**: Create simplified test tool with single string arg to isolate issue
3. **Trace callback execution**: Add logging inside the callback closure to see what it does
4. **Check Anthropic backend**: Verify ~gptel--parse-tool-results~ for Anthropic backend
5. **Compare with working tool**: Study ~persistent-agent~ callback structure in detail

* Provide Feature

#+begin_src emacs-lisp
(provide 'jf/gptel-questions)

;;; question-tools.el ends here
#+end_src
